MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M031FC1AE/mcu.h
/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M0 Processor and Core Peripherals */
#define __MPU_PRESENT           0       /*!< armikcmu does not provide a MPU present or not       */
#define __NVIC_PRIO_BITS        2       /*!< armikcmu Supports 2 Bits for the Priority Levels     */
#define __Vendor_SysTickConfig  0       /*!< Set to 1 if different SysTick Config is used         */

/*@}*/ /* end of group CMSIS_Device */

#include "core_cm0.h"                   /*!< Cortex-M0 processor and core peripherals             */
// Note: Changed for MikroE implementation.
// #include "system_M031Series.h"          /*!< M031 System                                    */
#include <stdint.h>

#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>

#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.


#if defined ( __CC_ARM   )
#pragma anon_unions
#endif


/**
 * Initialize the system clock
 *
 * @param  None
 * @return None
 *
 * @brief  Setup the microcontroller system
 *         Initialize the PLL and up2025-07-15 the SystemFrequency variable
 */
extern void SystemInit(void);



/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/

// Note: Changed for MikroE implementation.
// #include "acmp_reg.h"
// Note: Changed for MikroE implementation.
// #include "adc_reg.h"
// Note: Changed for MikroE implementation.
// #include "clk_reg.h"
// Note: Changed for MikroE implementation.
// #include "crc_reg.h"
// Note: Changed for MikroE implementation.
// #include "ebi_reg.h"
// Note: Changed for MikroE implementation.
// #include "fmc_reg.h"
// Note: Changed for MikroE implementation.
// #include "gpio_reg.h"
// Note: Changed for MikroE implementation.
// #include "hdiv_reg.h"
// Note: Changed for MikroE implementation.
// #include "i2c_reg.h"
// Note: Changed for MikroE implementation.
// #include "pdma_reg.h"
// Note: Changed for MikroE implementation.
// #include "pwm_reg.h"
// Note: Changed for MikroE implementation.
// #include "bpwm_reg.h"
// Note: Changed for MikroE implementation.
// #include "qspi_reg.h"
// Note: Changed for MikroE implementation.
// #include "spi_reg.h"
// Note: Changed for MikroE implementation.
// #include "sys_reg.h"
// Note: Changed for MikroE implementation.
// #include "rtc_reg.h"
// Note: Changed for MikroE implementation.
// #include "timer_reg.h"
// Note: Changed for MikroE implementation.
// #include "uart_reg.h"
// Note: Changed for MikroE implementation.
// #include "ui2c_reg.h"
// Note: Changed for MikroE implementation.
// #include "usbd_reg.h"
// Note: Changed for MikroE implementation.
// #include "uspi_reg.h"
// Note: Changed for MikroE implementation.
// #include "uuart_reg.h"
// Note: Changed for MikroE implementation.
// #include "wdt_reg.h"
// Note: Changed for MikroE implementation.
// #include "wwdt_reg.h"


/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/** @addtogroup PERIPHERAL_BASE Peripheral Memory Base
  Memory Mapped Structure for Series Peripheral
  @{
 */
/* Peripheral and SRAM base address */
#define FLASH_BASE          ((     uint32_t)0x00000000)
#define SRAM_BASE           ((     uint32_t)0x20000000)
#define AHB_BASE            ((     uint32_t)0x40000000)
#define APB1_BASE           ((     uint32_t)0x40000000)
#define APB2_BASE           ((     uint32_t)0x40000000)

/* Peripheral memory map */

#define SYS_BASE            (AHB_BASE       + 0x00000)                  /*!< System Global Controller Base Address            */
#define CLK_BASE            (AHB_BASE       + 0x00200)                  /*!< System Clock Controller Base Address             */
#define INT_BASE            (AHB_BASE       + 0x00300)                  /*!< Interrupt Source Controller Base Address         */
#define NMI_BASE            (AHB_BASE       + 0x00300)                  /*!< Interrupt Source Controller Base Address         */

#define GPIO_BASE           (AHB_BASE       + 0x4000)                   /*!< GPIO Base Address                                */
#define PA_BASE             (GPIO_BASE              )                   /*!< GPIO PA Base Address                             */
#define PB_BASE             (GPIO_BASE      + 0x0040)                   /*!< GPIO PB Base Address                             */
#define PC_BASE             (GPIO_BASE      + 0x0080)                   /*!< GPIO PC Base Address                             */
#define PD_BASE             (GPIO_BASE      + 0x00C0)                   /*!< GPIO PD Base Address                             */
#define PE_BASE             (GPIO_BASE      + 0x0100)                   /*!< GPIO PE Base Address                             */
#define PF_BASE             (GPIO_BASE      + 0x0140)                   /*!< GPIO PF Base Address                             */
#define PG_BASE             (GPIO_BASE      + 0x0180)                   /*!< GPIO PG Base Address                             */
#define PH_BASE             (GPIO_BASE      + 0x01C0)                   /*!< GPIO PH Base Address                             */
#define GPIO_DBCTL_BASE     (GPIO_BASE      + 0x0440)                   /*!< GPIO De-bounce Cycle Control Base Address        */
#define GPIO_PIN_DATA_BASE  (GPIO_BASE      + 0x0800)                   /*!< GPIO Pin Data Input/Output Control Base Address  */

